## `Plan Result Of gke`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.google_project.project: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_global_address.application_static_ip_address will be created
  + resource "google_compute_global_address" "application_static_ip_address" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + description        = "IP Address For Accessing Ingress"
      + id                 = (known after apply)
      + name               = "mintaklinebot-external-ip"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "VPC Network For Locating Private Google Kubernetes Cluster - mintaklinebot"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + name                            = "mintaklinebot-network"
      + project                         = (known after apply)
      + routing_mode                    = "REGIONAL"
      + self_link                       = (known after apply)
    }

  # google_compute_security_policy.security_policy will be created
  + resource "google_compute_security_policy" "security_policy" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "mintaklinebot-security-policy"
      + project     = (known after apply)
      + self_link   = (known after apply)

      + rule {
          + action      = "allow"
          + description = "White IP Address Lists"
          + priority    = 1000

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "220.215.227.226/32",
                    ]
                }
            }
        }
      + rule {
          + action      = "deny(403)"
          + description = "Deny Except Specific IP Address"
          + priority    = 2147483647

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "*",
                    ]
                }
            }
        }
    }

  # google_compute_ssl_policy.ssl_policy will be created
  + resource "google_compute_ssl_policy" "ssl_policy" {
      + creation_timestamp = (known after apply)
      + description        = "SSL Policy for mintaklinebot"
      + enabled_features   = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + min_tls_version    = "TLS_1_2"
      + name               = "mintaklinebot-ingress-ssl-policy"
      + profile            = "MODERN"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_subnetwork.subnetwork will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + description              = "VPC SubNetwork For Locating Private Google Kubernetes Cluster - mintaklinebot"
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.128.0.0/24"
      + name                     = "mintaklinebot-subnet"
      + network                  = (known after apply)
      + private_ip_google_access = true
      + project                  = (known after apply)
      + region                   = "us-central1"
      + secondary_ip_range       = [
          + {
              + ip_cidr_range = "172.16.0.0/18"
              + range_name    = "mintaklinebot-pod-ip-range"
            },
          + {
              + ip_cidr_range = "172.18.0.0/18"
              + range_name    = "mintaklinebot-service-ip-range"
            },
        ]
      + self_link                = (known after apply)
    }

  # google_container_cluster.vpc_native_cluster will be created
  + resource "google_container_cluster" "vpc_native_cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + description                 = "Cluster for mintaklinebot"
      + enable_binary_authorization = false
      + enable_intranode_visibility = false
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1-a"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "mintaklinebot"
      + network                     = (known after apply)
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + project                     = "mintak"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = (known after apply)
            }

          + dns_cache_config {
              + enabled = true
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + istio_config {
              + auth     = (known after apply)
              + disabled = (known after apply)
            }

          + kalm_config {
              + enabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + autoscaling_profile = (known after apply)
          + enabled             = (known after apply)

          + auto_provisioning_defaults {
              + min_cpu_platform = (known after apply)
              + oauth_scopes     = (known after apply)
              + service_account  = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + cluster_telemetry {
          + type = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "mintaklinebot-pod-ip-range"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "mintaklinebot-service-ip-range"
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "18:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)
          + password               = (sensitive value)
          + username               = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + network_policy {
          + enabled  = (known after apply)
          + provider = (known after apply)
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
            }

          + linux_node_config {
              + sysctls = (known after apply)
            }

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = (known after apply)
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = (known after apply)
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + kubelet_config {
                  + cpu_cfs_quota        = (known after apply)
                  + cpu_cfs_quota_period = (known after apply)
                  + cpu_manager_policy   = (known after apply)
                }

              + linux_node_config {
                  + sysctls = (known after apply)
                }

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + notification_config {
          + pubsub {
              + enabled = (known after apply)
              + topic   = (known after apply)
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "192.168.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = (known after apply)
            }
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + timeouts {
          + create = "15m"
          + delete = "15m"
          + update = "10m"
        }

      + workload_identity_config {
          + identity_namespace = "mintak.svc.id.goog"
        }
    }

  # google_container_node_pool.vpc_native_cluster_nodes will be created
  + resource "google_container_node_pool" "vpc_native_cluster_nodes" {
      + cluster             = "mintaklinebot"
      + id                  = (known after apply)
      + initial_node_count  = (known after apply)
      + instance_group_urls = (known after apply)
      + location            = "us-central1-a"
      + max_pods_per_node   = (known after apply)
      + name                = "terraform"
      + name_prefix         = (known after apply)
      + node_count          = 1
      + node_locations      = (known after apply)
      + project             = (known after apply)
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 3
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = "COS_CONTAINERD"
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
        }
    }

  # google_project_iam_binding.gke_role will be created
  + resource "google_project_iam_binding" "gke_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = (known after apply)
    }

  # google_project_iam_custom_role.role_for_gke will be created
  + resource "google_project_iam_custom_role" "role_for_gke" {
      + deleted     = (known after apply)
      + description = "Custom Role For Google Kubernetes Engine (mintaklinebot)"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "logging.logEntries.create",
          + "monitoring.alertPolicies.get",
          + "monitoring.alertPolicies.list",
          + "monitoring.dashboards.get",
          + "monitoring.dashboards.list",
          + "monitoring.groups.get",
          + "monitoring.groups.list",
          + "monitoring.metricDescriptors.create",
          + "monitoring.metricDescriptors.get",
          + "monitoring.metricDescriptors.list",
          + "monitoring.monitoredResourceDescriptors.get",
          + "monitoring.monitoredResourceDescriptors.list",
          + "monitoring.notificationChannelDescriptors.get",
          + "monitoring.notificationChannelDescriptors.list",
          + "monitoring.notificationChannels.get",
          + "monitoring.notificationChannels.list",
          + "monitoring.publicWidgets.get",
          + "monitoring.publicWidgets.list",
          + "monitoring.services.get",
          + "monitoring.services.list",
          + "monitoring.slos.get",
          + "monitoring.slos.list",
          + "monitoring.timeSeries.create",
          + "monitoring.timeSeries.list",
          + "monitoring.uptimeCheckConfigs.get",
          + "monitoring.uptimeCheckConfigs.list",
          + "opsconfigmonitoring.resourceMetadata.list",
          + "resourcemanager.projects.get",
          + "stackdriver.projects.get",
          + "storage.objects.get",
          + "storage.objects.list",
        ]
      + project     = (known after apply)
      + role_id     = "gke_mintaklinebot"
      + stage       = "GA"
      + title       = "mintaklinebot Kubernetes Engine"
    }

  # google_project_service.project[0] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "iam.googleapis.com"
    }

  # google_project_service.project[1] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "storage-component.googleapis.com"
    }

  # google_project_service.project[2] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.project[3] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "container.googleapis.com"
    }

  # google_service_account.sa_for_gke will be created
  + resource "google_service_account" "sa_for_gke" {
      + account_id   = "gke-mintaklinebot"
      + description  = "Google Kubernetes Engine (mintaklinebot)に設定するサービスアカウント"
      + display_name = "Google Kubernetes Engine (mintaklinebot) service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_id                = (known after apply)
  + external_ip_address       = (known after apply)
  + kubernetes_master_version = (known after apply)
  + nodepool_id               = (known after apply)
  + vpc_network_id            = (known after apply)
  + vpc_subnetwork_id         = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @mintak21, Action: `pull_request`, Workflow: `Lint`*